Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `valueId` that resolves to `\nA12345` will be rendered as `\nA12345` that will result in an invalid JSON Object because of the new line inserted inside the string value for the attribute `id`.
ja_jp: `\nA12345` に解決される `valueId` は `\nA12345` としてレンダリングされますが、属性 `id` の文字列値内に新しい行が挿入されるため、無効な JSON オブジェクトになります。

source: `valueName` that resolves to `\tExpressions \n Escapes` will be rendered as `\\tExpressions \\n Escapes`.
ja_jp: `\ Expressions \n Escapes` に対して解決される `valueName` は `\\ Expressions \\n Escapes` とレンダリングされます。

source: `values`: Returns a Collection view of the values contained in a map
ja_jp: `values` : マップに含まれる値のコレクションビューを返します。

source: `version` - Version of this generated project.
ja_jp: `version` - この生成されたプロジェクトのバージョン。

source: `vertx`, which provides access to the underlying managed Vert.x
ja_jp: `vertx` 、下地となるマネージドVert.xへのアクセスを提供します。

source: `void`: Indicates a blocking method where no explicit message is sent back to the connected client.
ja_jp: `void`: 接続されたクライアントに明示的なメッセージが返されないブロッキングメソッドを示します。

source: `void`: Indicates a blocking method where no explicit response is sent back to the client.
ja_jp: `void`: 明示的なレスポンスがクライアントに返されないブロッキングメソッドを示します。

source: `void`: The method is considered blocking.
ja_jp: `void`: メソッドはブロッキングであるとみなされます。

source: `where <query>` will expand to `from EntityName where <query>`
ja_jp: `where <query>` は `from EntityName where <query>` に展開されます。

source: `xAndAwait()` methods - blocks the caller thread until the outcome is received. In the case of a failure, throws a `RuntimeException`
ja_jp: `xAndAwait()` メソッド - 結果を受け取るまで呼び出し元のスレッドをブロックします。失敗した場合は `RuntimeException` を発生させます

source: `xAndForget()` methods - triggers the operation, discard the outcome
ja_jp: `xAndForget()` methods - 操作をトリガし、結果を破棄します。

source: `xx()` - Only set the key if it already exists.
ja_jp: `xx()`: キーがすでに存在する場合にのみ、キーを設定します。

source: `y` or `true` - The debug mode JVM launch is suspended
ja_jp: `y` または `true` - デバッグモードの JVM 起動が中断されます。

source: `{'$inc': {'cpt': ?1}}` will be used as-is
ja_jp: `{'$inc': {'cpt': ?1}}` はそのまま使用されます。

source: `{'firstname' : :firstname and 'status' : :status}` ` will be mapped to the update document `{'$set' : {'firstname': :firstname, 'status': :status}}`
ja_jp: `{'firstname' : :firstname and 'status' : :status}` は、更新ドキュメント `{'$set' : {'firstname': :firstname, 'status': :status}}` にマップされます。

source: `{'firstname' : :firstname and 'status' : :status}` will be mapped to the update document `{'$set' : {'firstname': :firstname, 'status': :status}}`
ja_jp: `{'firstname' : :firstname and 'status' : :status}` は、更新ドキュメント `{'$set' : {'firstname': :firstname, 'status': :status}}` にマップされます。

source: `{'firstname' : ?1 and 'status' : ?2}` will be mapped to the update document `{'$set' : {'firstname': ?1, 'status': ?2}}`
ja_jp: `{'firstname' : ?1 and 'status' : ?2}` は、更新ドキュメント `{'$set' : {'firstname': ?1, 'status': ?2}}` にマップされます。

source: `{'firstname' : ?1, 'status' : ?2}` will be mapped to the update document `{'$set' : {'firstname': ?1, 'status': ?2}}`
ja_jp: `{'firstname' : ?1, 'status' : ?2}` は更新ドキュメント `{'$set' : {'firstname': ?1, 'status': ?2}}` にマッピングされます。

source: `{'firstname' : firstname, 'status' : :status}` ` will be mapped to the update document `{'$set' : {'firstname': :firstname, 'status': :status}}`
ja_jp: `{'firstname' : firstname, 'status' : :status}` `は、アップデートドキュメントに `{'$set' : {'firstname': :firstname, 'status': :status}}` マッピングされます。

source: `{0}` is substituted by the `uid`, whereas `{1}` will be substituted by the `dn` of the user entry.
ja_jp: `{0}` は `uid` で置換され、 `{1}` はユーザーエントリーの `dn` で置換されます。

source: `{0}` is substituted by the `uid`.
ja_jp: `{0}` は、 `uid` で置換されます。

source: `{config-file}` with an explicit `db-version`
ja_jp: 明示的な `db-version` を持つ `{config-file}`

source: `{config-file}` with an explicit `dialect`
ja_jp: 明示的な `dialect` を持つ `{config-file}`

source: `{config-file}` with an explicit `dialect` and `db-version`
ja_jp: 明示的な `dialect` と `db-version` を持つ `{config-file}`

source: `{config:foo}` or `{config:['property.with.dot.in.name']}`
ja_jp: `{config:foo}` または `{config:['property.with.dot.in.name']}`

source: `{http:param('name', 'Quarkus')}` is an expression that is evaluated when the template is rendered (Quarkus is the default value).
ja_jp: `{http:param('name', 'Quarkus')}` は、テンプレートがレンダリングされるときに評価される式です (Quarkus がデフォルト値です)。

source: `{item.isActive ? item.name : 'Inactive item'}` outputs the value of `item.name` if `item.isActive` resolves to `true`.
ja_jp: `{item.isActive ? item.name : 'Inactive item'}` は、`item.isActive` が `true` に解決する場合、`item.name` の値を出力します。

source: `{name}` is a value expression that is evaluated when the template is rendered.
ja_jp: `{name}` は、テンプレートがレンダリングされたときに評価される値の式です。

source: `{pets.orEmpty.size}` outputs `0` if `pets` is not resolvable or `null`
ja_jp: `{pets.orEmpty.size}` は、`pets` が解決可能でないか、`null` であれば `0` を出力します。

source: `{port}` - The JVM is started in debug mode and will be listening on `{port}`
ja_jp: `{port}` - JVM はデバッグモードで開始され、 `{port}` でリッスンします

source: `{prerequisites-docker-compose}` adds `Docker and Docker Compose or xref:podman.adoc[Podman], and Docker Compose`.
ja_jp: `{prerequisites-docker-compose}` は `Docker および Docker Compose または xref:podman.adoc[Podman]、および Docker Compose` を追加します。

source: `{prerequisites-docker}` adds `* A working container runtime (Docker or xref:podman.adoc[Podman])`.
ja_jp: `{prerequisites-docker}` は `*動作するコンテナランタイム(Docker, xref:podman.adoc[Podman])` を追加します。

source: `{prerequisites-graalvm-mandatory}` adds `* Mandrel or GraalVM installed and xref:building-native-image.adoc#configuring-graalvm[configured appropriately]`.
ja_jp: `{prerequisites-graalvm-mandatory}` は、MandrelまたはGraalVMがインストールされ、 link:building-native-image.html#configuring-graalvm[適切に設定されていること] を追加します。

source: `{prerequisites-no-cli}` removes `* Optionally the xref:cli-tooling.adoc[Quarkus CLI] if you want to use it`.
ja_jp: `{prerequisites-no-cli}` は、 `*CLI を使用する場合は xref:cli-tooling.adoc[Quarkus CLI] を使用する` を削除します。

source: `{prerequisites-no-graalvm}` or `{prerequisites-graalvm-mandatory}` remove `* Optionally Mandrel or GraalVM installed and xref:building-native-image.adoc#configuring-graalvm[configured appropriately] if you want to build a native executable (or Docker if you use a native container build)`.
ja_jp: `{prerequisites-no-graalvm}` または `{prerequisites-graalvm-mandatory}` は `*ネイティブ実行可能ファイルをビルドする場合、MandrelまたはGraalVM（あるいはネイティブなコンテナビルドを使用する場合はDocker）をインストールし、 link:building-native-image.html#configuring-graalvm[適切に設定]している` を削除します。

source: `{prerequisites-no-maven}` removes `* Apache Maven <maven version>`.
ja_jp: `{prerequisites-no-maven}` は `* Apache Maven <maven version>` を削除します。

source: `{prerequisites-time}: <number of minutes>` overrides the default value of 15 minutes. For example, `{prerequisites-time}: 30` adds `* Roughly 30 minutes`.
ja_jp: `{prerequisites-time} :<number of minutes> ` はデフォルト値の 15 分を上書きします。たとえば、 `{prerequisites-time}: 30` は `*約 30 分` を追加します。

source: `{quarkus-platform-groupid}` is the default `groupId`. Specifying `-P :quarkus-bom:` is equivalent to `-P {quarkus-platform-groupid}:quarkus-bom:{quarkus-version}`. Note that you need to specify the `groupId` to work with a snapshot, e.g. `-P io.quarkus::999-SNAPSHOT` is equivalent to `-P io.quarkus:quarkus-bom:999-SNAPSHOT`.
ja_jp: `{quarkus-platform-groupid}` はデフォルトの `groupId` です。 `-P :quarkus-bom:` を指定すると、 `-P {quarkus-platform-groupid}:quarkus-bom:{quarkus-version}` と同じになります。スナップショットを操作するには `groupId` を指定する必要があることに注意してください。たとえば、 `-P io.quarkus::999-SNAPSHOT` は `-P io.quarkus:quarkus-bom:999-SNAPSHOT` と同じです。

source: `{str:builder('Qute') + "is" + whatisqute + "!"}` yields `Qute is cool!` if `whatisqute` resolves to `cool`
ja_jp: `{str:builder('Qute') + "is" + whatisqute + "!"}` `whatisqute` が `cool` に解決される場合、`Qute is cool!` が生成されます。

source: `{str:builder('Qute').append("is").append("cool!")}` yields `Qute is cool!`
ja_jp: `{str:builder('Qute').append("is").append("cool!")}` は `Qute is cool!` を生成します。

source: `{str:concat("Hello ",name,"!")}` yields `Hello Foo!` if `name` resolves to `Foo`
ja_jp: `{str:concat("Hello ",name,"!")}` `name` が `Foo` に解決された場合、`Hello Foo!` が返されます。

source: `{str:eval('/path/to/{fileName}')}` yields `/path/to/file.txt` if `fileName` resolves to `file.txt`
ja_jp: `{str:eval('/path/to/{fileName}')}` は、`fileName` が `file.txt` に解決される場合、`/path/to/file.txt` を生成します。

source: `{str:eval('Hello {name}!')` yields `Hello lovely!` if `name` resolves to `lovely`
ja_jp: `{str:eval('Hello {name}!')` は、`name` が `lovely` に解決された場合、`Hello lovely!` を返します。

source: `{str:eval(myTemplate)}` yields `Hello lovely!` if `myTemplate` resolves to `Hello {name}!` and `name` resolves to `lovely`
ja_jp: `{str:eval(myTemplate)}` `myTemplate` が `Hello lovely!` に解決された場合、`Hello{name}!` と `name` は `lovely` に対して解決されます。

source: `{str:join('_','Qute','is','cool')}` yields `Qute_is_cool`
ja_jp: `{str:join('_','Qute','is','cool')}` は `Qute_is_cool` を生成します

source: a GitHub account and a GitHub Personal Access token
ja_jp: GitHubアカウントとGitHubパーソナルアクセストークン

source: a JSON element which can be a https://vertx.io/docs/apidocs/io/vertx/core/json/JsonArray.html[`JsonArray`], https://vertx.io/docs/apidocs/io/vertx/core/json/JsonObject.html[`JsonObject`], `String`, ...etc if the buffer contains an array, object, string, ...etc
ja_jp: バッファーに配列、オブジェクト、文字列などが含まれる場合に https://vertx.io/docs/apidocs/io/vertx/core/json/JsonArray.html[`JsonArray`]、 https://vertx.io/docs/apidocs/io/vertx/core/json/JsonObject.html[`JsonObject`] 、 `String` などにできる JSON 要素

source: a _high-level_ imperative data source: A type-safe, high-level API to interact with Redis. It is the imperative variant of the reactive data source. It exposes the `io.quarkus.redis.datasource.RedisDataSource` interface.
ja_jp: _高レベルの_ 命令型データソース: Redis と対話するための、タイプセーフな高レベル API です。これはリアクティブデータソースの命令型バリアントです。 `io.quarkus.redis.datasource.RedisDataSource` インターフェイスを公開します。

source: a _high-level_ reactive data source: A type-safe, high-level API to interact with Redis. This API is fully reactive and asynchronous. It exposes a Mutiny API. It exposes the `io.quarkus.redis.datasource.ReactiveRedisDataSource` interface.
ja_jp: _高レベルの_ リアクティブデータソース: Redis と対話するための、タイプセーフな高レベル API です。この API は完全にリアクティブで非同期です。これは、Mutiny API を公開します。 `io.quarkus.redis.datasource.ReactiveRedisDataSource` インターフェイスを公開します。

source: a `Multi<Buffer>` - the buffers are written one by one (one per _chunk_) without any processing.
ja_jp: `Multi<Buffer>` - バッファーは処理なしで 1 つずつ (_チャンク_ ごとに 1 つ) 書き込まれます。

source: a `Multi<Object>` - the items are encoded to JSON written one by one in the response.
ja_jp: `Multi<Object>` - アイテムは、レスポンスに 1 つずつ書き込まれる JSON にエンコードされます。

source: a `Multi<String>` - the items are written one by one (one per _chunk_) in the response.
ja_jp: `Multi<String>` - アイテムはレスポンスに 1 つずつ (_チャンク_ ごとに 1 つ) 書き込まれます。

source: a `QuarkusCqlSession` bean;
ja_jp: `QuarkusCqlSession` Bean;

source: a blocking stub using the gRPC API,
ja_jp: gRPC APIを使用したブロッキングスタブ

source: a buffer - written into the HTTP response directly
ja_jp: バッファー - HTTP レスポンスに直接書き込まれます

source: a built-in command: `#`, `!`, `@`, `/`.
ja_jp: 組み込みコマンド ( `#` 、 `!` 、 `@` 、 `/` )

source: a container runtime is required.
ja_jp: コンテナーランタイムが必要です。

source: a context fetching strategy among:
ja_jp: 以下のコンテキスト取得ストラテジー

source: a datasource named `inventory`
ja_jp: `inventory` という名前のデータソース

source: a datasource named `users`
ja_jp: `users` という名前のデータソース

source: a delegate `ScheduledExecutorService` of your choice (hint: you can reuse `Infrastructure.getDefaultWorkerPool()`), and
ja_jp: 選択したデリゲート `ScheduledExecutorService` (ヒント: `Infrastructure.getDefaultWorkerPool()` を再利用できます)、および

source: a digit, or
ja_jp: 数字、または

source: a few things that don't make sense for a non-blocking implementations, such as setting the `ExecutorService`, don't work
ja_jp: `ExecutorService` の設定など、非ブロッキング実装には意味をなさないいくつかのことが機能しません

source: a fruit is added, or
ja_jp: fruit が追加される、または

source: a fruit is deleted.
ja_jp: fruit は削除される。

source: a landing page accessible on `http://localhost:8080`
ja_jp: ランディングページは次の URL でアクセス可能です: `http://localhost:8080`

source: a landing page that is accessible on `http://localhost:8080` after starting the application
ja_jp: アプリケーション起動後に `http://localhost:8080` でアクセス可能な Web ページ

source: a liveness health check based on the Kafka Streams state.
ja_jp: Kafka Streams の状態に基づく Liveness ヘルスチェック

source: a message containing the _name_ is sent to the event bus
ja_jp: _name_ を含むメッセージがイベントバスに送信されます。

source: a name of the codestart to which the data nested under it should be passed
ja_jp: その下にネストされたデータを渡すコードスタートの名前

source: a non-anonymous caller name of client_id
ja_jp: client_id の匿名でない呼出元名

source: a non-anonymous caller name of jdoe@quarkus.io
ja_jp: jdoe@quarkus.io という非匿名の発信者名

source: a non-null JsonWebToken
ja_jp: 非 null の JsonWebToken

source: a normalizer called `sort` for our sort fields
ja_jp: ソートフィールド用の `sort` というノーマライザー

source: a reactive stub based on Mutiny,
ja_jp: Mutinyをベースにしたリアクティブ・スタブ

source: a readiness health check to validate that all topics declared in the `quarkus.kafka-streams.topics` property are created,
ja_jp: `quarkus.kafka-streams.topics` プロパティで宣言されたすべてのトピックが作成されているかどうかを確認するための Readiness ヘルスチェック

source: a service interface using the Mutiny API,
ja_jp: Mutiny APIを使用したサービスインターフェース

source: a string - written into the HTTP response directly
ja_jp: 文字列 - HTTP レスポンスに直接書き込まれます

source: a valid Kube config file is found and `quarkus.kubernetes-client.devservices.override-kubeconfig` is not set to `true`
ja_jp: 有効な Kube 設定ファイルが見つかり、 `quarkus.kubernetes-client.devservices.override-kubeconfig` が `true` に設定されていない場合

source: access the `http://localhost:8080/q/health/live` endpoint using your browser or `curl http://localhost:8080/q/health/live`
ja_jp: `http://localhost:8080/q/health/live` エンドポイントにブラウザか、 `curl http://localhost:8080/q/health/live` でアクセス

source: access token `expires_in` property
ja_jp: アクセストークンの `expires_in` プロパティー

source: accessible with the `global:` namespace.
ja_jp: `global:` 名前空間でアクセス可能です。

source: accessing `/api/admin` will return `200`
ja_jp: `/api/admin` にアクセスすると、 `200` が返されます

source: accessing `/api/admin` will return `403`
ja_jp: `/api/admin` にアクセスすると、 `403` が返されます

source: accessing `/api/users/me` will return `200`
ja_jp: `/api/users/me` にアクセスすると、 `200` が返されます

source: accessing `/frontend/admin-name-with-propagated-token` will return `200`
ja_jp: `/frontend/admin-name-with-propagated-token` にアクセスすると `200` が返されます

source: accessing `/frontend/admin-name-with-propagated-token` will return `403`
ja_jp: `/frontend/admin-name-with-propagated-token` にアクセスすると `403` が返されます

source: accessing `/frontend/user-name-with-propagated-token` will return `200`
ja_jp: `/frontend/user-name-with-propagated-token` にアクセスすると `200` が返されます

source: actionId: The unique (autoscoped) action id
ja_jp: actionId: 一意の (自動スコープの) アクション ID

source: activate the `migrate-at-start` option to migrate the schema automatically or inject the `Flyway` object and run your migration as you normally do
ja_jp: `migrate-at-start` オプションを有効にしてスキーマを自動的に移行するか、 `Flyway` オブジェクトを注入して通常のように移行を実行します。

source: activate the `migrate-at-start` option to migrate the schema automatically or inject the `Liquibase` object and run your migration as you normally do.
ja_jp: `migrate-at-start` オプションを有効にしてスキーマを自動的に移行するか、 `Liquibase` オブジェクトをインジェクトして通常通りにマイグレーションを実行します。

source: add new fruits to the list via the form
ja_jp: フォームを使って新しいフルーツをリストに追加します。

source: add new fruits to the list via the form :!devtools-wrapped:
ja_jp: フォームから新しいフルーツをリストに追加 :!devtools-wrapped：

source: add your changeLog to the `{change-log}` file as you usually do with Liquibase
ja_jp: Liquibase で通常行っているように、changeLog を `{change-log}` ファイルに追加します。

source: add your configuration settings in `{config-file}`
ja_jp: `{config-file}` に設定を追加します。

source: add your migrations to the `{migrations-path}` folder as you usually do with Flyway
ja_jp: Flyway で通常行うように、マイグレーションを `{migrations-path}` フォルダーに追加します。

source: add your settings in `{config-file}`
ja_jp: `{config-file}` で設定を追加します

source: added as _computed data_ of any `TemplateInstance` during initialization,
ja_jp: 初期化中に、任意の `TemplateInstance` の _計算データ_ として追加されます。

source: adding the `smallrye-fault-tolerance` Quarkus extension to your project using the `quarkus-maven-plugin`:
ja_jp: `quarkus-maven-plugin` で `smallrye-fault-tolerance` Quarkus エクステンションをプロジェクトに追加することです :

source: adding the `smallrye-health` Quarkus extension to your project using the `quarkus-maven-plugin`:
ja_jp: `quarkus-maven-plugin` で `smallrye-health` Quarkusエクステンションをプロジェクトに追加します:

source: additional properties, including:
ja_jp: 以下を含むプロパティーを追加しました。

source: after the observer notification completes for an event, if it was not already active when the notification started.
ja_jp: 通知が開始したときにまだアクティブではなかった場合はイベントのオブザーバー通知が完了した後

source: ahead of time optimal
ja_jp: 事前最適化

source: ahead-of-time native binary (executable binary)
ja_jp: 事前最適化されたネイティブバイナリー (実行可能バイナリー)

source: all files in the `bar/` directory and its subdirectories except for `another-proto.proto`.
ja_jp: `bar/` ディレクトリの全てのファイルと `another-proto.proto` を除くすべてのそのサブディレクトリ。

source: all files in the `foo/` directory and its subdirectories except for files in `foo/private/` and its subdirectories,
ja_jp: `foo/` ディレクトリーとそのサブディレクトリーにあるすべてのファイルのうち、 `foo/private/` とそのサブディレクトリーにあるファイルを除く。

source: all files in the `foo/` directory and its subdirectories,
ja_jp: `foo/` ディレクトリーおよびそのサブディレクトリー内のすべてのファイル、

source: all text files in the `bar/` directory and its subdirectories.
ja_jp: `bar/` ディレクトリーとそのサブディレクトリーにあるすべてのテキストファイル。

source: all the Reactive Messaging AMQP channels have the `host` or `port` attributes set
ja_jp: すべてのReactive Messaging AMQPチャンネルに `host` または `port` の属性が設定されている場合

source: all the Reactive Messaging Kafka channels have either the `apicurio.registry.url` attribute or the `schema.registry.url` attribute set
ja_jp: すべてのReactive Messaging Kafkaチャンネルには `apicurio.registry.url` 属性か、 `schema.registry.url` 属性が設定されています

source: all the Reactive Messaging Kafka channels have the `apicurio.registry.url` attribute set
ja_jp: すべてのReactive Messaging Kafkaチャンネルには `apicurio.registry.url` 属性が設定されています。

source: all the Reactive Messaging Kafka channels have the `bootstrap.servers` attribute set
ja_jp: すべてのReactive Messaging Kafkaチャンネルに `bootstrap.servers` 属性が設定されている場合

source: all the Reactive Messaging Pulsar channels have the `serviceUrl` attribute set
ja_jp: すべての Reactive Messaging Pulsar チャネルには `serviceUrl`属性が設定されている

source: all the Reactive Messaging RabbitMQ channels have the `host` or `port` attributes set
ja_jp: すべてのReactive Messaging RabbitMQチャンネルに `host` または `port` の属性が設定されていること。

source: allows plain-text communication as well as TLS, and TLS with mutual authentication
ja_jp: 平文通信に加えてTLS、相互認証付きのTLSも可能です

source: an IDE
ja_jp: IDE

source: an `enforcedPlatform` directive for the Quarkus BOM
ja_jp: Quarkus BOM 用の `enforcedPlatform` ディレクティブ

source: an `org.acme.GreetingResource` resource exposed on `/hello`
ja_jp: `/hello` で公開される `org.acme.getting.start.GreetingResource` リソース

source: an alphabet character, or
ja_jp: アルファベット文字、または

source: an analyzer called `english` for book titles,
ja_jp: 書籍のタイトル用の `english` というアナライザー,

source: an analyzer called `name` for person names,
ja_jp: 人名用の `name` というアナライザー,

source: an artifact key (in the format of `groupId:artifactId[:<classifier>:<extension>]` but typically simply `<groupId>:<artifactId>`) of the artifact that must be present among the application dependencies for the condition to be satisfied.
ja_jp: 条件を満たすためにアプリケーションの依存関係の中に存在しなければならないアーティファクトのアーティファクトキー（`groupId:artifactId[:<classifier>:<extension>]` の形式で、通常は単に `<groupId>:<artifactId>`）。

source: an associated unit test
ja_jp: 関連するユニットテスト

source: an authentication scheme of Bearer
ja_jp: ベアラーの認証スキーム

source: an authentication scheme of OAuth2
ja_jp: OAuth2 の認証スキーム

source: an explicit `Context`, or
ja_jp: 明示的な `Context`、または

source: an explicitly defined `quarkus.native.compression.container-image`;
ja_jp: 明示的に定義された `quarkus.native.compression.container-image`;

source: an object - written into the HTTP response after having been encoded into JSON. The `content-type` header is set to `application/json` if not already set.
ja_jp: オブジェクト - JSON にエンコードされた後に HTTP レスポンスに書き込まれます。まだ設定されていない場合、 `content-type` ヘッダーは `application/json` に設定されます。

source: analyze the concept from multiple perspectives and draw comparisons with alternative concepts discuss if it is relevant and useful for the reader's understanding.
ja_jp: コンセプトを多角的に分析して他のコンセプトと比較し、読者が理解するために適切かつ有用であるか議論します。

source: and
ja_jp: および

source: and 2. Fall back to the <<database-approach,database approach>>.
ja_jp: および 2. <<database-approach,DATABASE アプローチ>> にフォールバックする。

source: and Quarkus integration code.
ja_jp: Quarkus の統合コード

source: and add it to the registered user:
ja_jp: それを登録済みユーザーに追加します。

source: and add the BouncyCastle FIPS provider dependency:
ja_jp: そして、BouncyCastle FIPSプロバイダの依存関係を追加します :

source: and add the BouncyCastle TLS dependency:
ja_jp: そして、BouncyCastleのTLS依存関係を追加します :

source: and add the BouncyCastle provider dependency:
ja_jp: そして、BouncyCastleプロバイダ依存関係を追加します :

source: and application login page will contain HTML form similar to this:
ja_jp: アプリケーションのログインページには、以下と同様の HTML フォームが含まれます。

source: and at this point it is possible to obtain a reference to the KieSession evaluating the formerly defined rules and use it in a REST endpoint as it follows:
ja_jp: この時点で、以前に定義したルールを評価する KieSession への参照を取得し、次のように REST エンドポイントで使用することができます。

source: and authorize the `QuarkusAuth0` application to access your account:
ja_jp: 次に、 `QuarkusAuth0` アプリケーションによるアカウントへのアクセスを認可します。

source: and configure Google OIDC properties:
ja_jp: そしてGoogle OIDCプロパティーを設定します。

source: and configure it in the usual Quarkus way (for example using `application.properties`) like so:
ja_jp: そして、通常のQuarkusの方法で（たとえば、 `application.properties` を使用して）、次のように設定します:

source: and enabled at runtime with a system property or environment variable, for example: `-Dquarkus.http.auth.permission.permit1.enabled=true`.
ja_jp: また、実行時にシステムプロパティや環境変数で有効にすることもできます。例えばこのような形です。 `-Dquarkus.http.auth.permission.permit1.enabled=true`.

source: and end it in a different method:
ja_jp: そして別の方法で終わらせます。

source: and enjoy a highly productive environment.
ja_jp: そして、生産性の高い環境をお楽しみください。

source: and executed using `java -jar target/quarkus-app/quarkus-run.jar`.
ja_jp: そして次のように実行します `java -jar target/quarkus-app/quarkus-run.jar` 。

source: and executed with `java -jar target/quarkus-app/quarkus-run.jar`.
ja_jp: そして次のコマンドで実行できます。 `java -jar target/quarkus-app/quarkus-run.jar`.

source: and finally write the test code, for example:
ja_jp: 最後に、例えば次のようにテストコードを書きます。

source: and finally write the test code. Given the Wiremock-based resource above, the first test invocation should return `access_token_1` access token which will expire in 4 seconds. Use `awaitility` to wait for about 5 seconds, and now the next test invocation should return `access_token_2` access token which confirms the expired `access_token_1` access token has been refreshed.
ja_jp: そして最後にテストコードを書きます。上記の Wiremock ベースのリソースがある場合、最初のテスト起動では `access_token_1` アクセストークンが返却されますが、このアクセストークンは 4 秒で期限切れになります。 `awaitility` を使用して約 5 秒間待つと、次のテスト起動時に `access_token_2` アクセストークンが返され、期限切れの `access_token_1` アクセストークンがリフレッシュされたことが確認できます。

source: and for Windows:
ja_jp: Windowsの場合は次を実行下さい：

source: and in native mode:
ja_jp: および、ネイティブモードで以下を実行します。

source: and in the case of using the Maven configuration instead of `application.properties`:
ja_jp: `application.properties` の代わりに Maven 設定を使用する場合。

source: and more
ja_jp: その他
